Public Member Functions | Friends | List of all members
ACAPI::ModelCheckManager Class Reference
Model Quality Check Management
ModelCheckManager is a class to access the Model Quality Check services. More...
#include <ModelCheckManager.hpp>
 Inheritance diagram for ACAPI::ModelCheckManager:
 Public Member Functions
ACAPI::Result< void >  | RegisterGroup (const API_Guid &modelCheckTypeId, const API_Guid &groupId, const GS::UniString &groupName) const
Registers a new Model Check Method Group.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
ModelCheckManager  | GetModelCheckManager ()
A function to create ModelCheckManager instance.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
ModelCheckManager is a class to access the Model Quality Check services.
Since
Archicad 29
Member Function Documentation
◆ RegisterGroup()
 ACAPI::Result< void > ACAPI::ModelCheckManager::RegisterGroup  |  ( |  const API_Guid & |  modelCheckTypeId,
|  const API_Guid & |  groupId,
|  const GS::UniString & |  groupName ) const
Registers a new Model Check Method Group.
Parameters
modelCheckTypeId | The parent Model Check Type id where the new group will be registered.
groupId | Unique identifier of the group. Later it can be used to register Model Check Method in the group.
groupName | Localized name of the new Model Check Group. It will be presented on the user interface.
Note
This function should be called only from the RegisterInterface () function of the AddOn.
Returns
Error with error code and message if there was any, otherwise nothing.
Friends And Related Symbol Documentation
◆ GetModelCheckManager
 ModelCheckManager GetModelCheckManager  |  ( |   | )
friend
A function to create ModelCheckManager instance.
Since
Archicad 29
Returns
Returns the ModelCheckManager instance.